Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/unemployed_people/self_employed_and_unemployment.html.txt.tmx
Source language: en
Languages: ga

source: Self-employed people can become unemployed if their business has to close down
ga: Is féidir le daoine féinfhostaithe a bheith dífhostaithe má dhúnann a gcuid gnó

source: It may also be the case, though you continue to be self-employed the amount of work you are getting has reduced so much that it no longer provides you with a sufficient income
ga: Cé go leanfá de bheith féinfhostaithe, d’fhéadfadh sé tarlú go bhfuil laghdú chomh mór ar do chuid oibre nach soláthraítear dóthain ioncaim duit níos mó

source: If you find yourself unemployed or you are getting less work than before you may qualify for a jobseeker's payment
ga: Má tharlaíonn go bhfuil tú dífhostaithe nó má thagann laghdú ar do chuid oibre, d'fhéadfá a bheith incháilithe d’íocaíocht leasa shóisialaigh

source: You do not need to de-register as self-employed to get a payment. However you must meet the conditions that apply to jobseeker's payments
ga: Ní gá duit díchlárú mar dhuine féinfhostaithe chun íocaíocht leasa shóisialaigh a fháil

source: If you do not qualify for a social welfare payment you may be eligible to pay voluntary contributions
ga: Mura gcáilíonn tú le haghaidh íocaíochta leasa shóisialaigh, d'fhéadfá cáiligh chun ranníocaíochtaí deonacha a íoc

source: Self-employed people pay Class S PRSI
ga: Íocann daoine féinfhostaithe ÁSPC in Aicme S

source: Class S PRSI only covers you for certain social welfare payments
ga: Clúdaíonn ÁSPC Aicme S íocaíochtaí leasa shóisialaigh áirithe amháin

source: It does not cover you for Jobseeker’s Benefit
ga: Ní chlúdaítear Sochar Cuardaitheora Poist

source: However, if you worked as an employee in the last 4 years, you may have paid Class A PRSI and should apply to your local Intreo Centre or social welfare local office for Jobseeker’s Benefit
ga: Mar sin má d’oibrigh tú mar fhostaí sa 4 bhliain chánach is déanaí, b’fhéidir gur íoc tú ÁSPC Aicme A agus ba chóir duit iarratas a dhéanamh ar Shochar Sochar Cuardaitheora Poist i d'Ionad Intreo nó d’Oifig Leasa Shóisialaigh áitiúil

source: Your Intreo centre or social welfare local office will check their records to find out whether you have enough Class A contributions to get Jobseeker’s Benefit
ga: Déanfaidh d’Oifig Leasa Shóisialaigh áitiúil do thaifid a sheiceáil chun fáil amach cibé an bhfuil dóthain ranníocaíochtaí Aicme A agat chun Sochar Cuardaitheora Poist a fháil

source: If you work part-time you may qualify for Jobseeker’s Benefit
ga: Is féidir leat leanúint le Sochar Cuardaitheora Poist a fháil agus tú agus beagán oibre a dhéanamh

source: However, you must have lost at least one day of employment and as a result of this loss be unemployed for at least 4 days out of 7 days
ga: Mar sin féin, caithfidh tú lá amháin fostaíochta a chailliúint ar a laghad - agus a bheith dífhostaithe 4 lá as 7 ar a laghad dá bharr

source: Your earnings must also have been reduced because of the loss of employment
ga: Lena chois sin, caithfidh laghdú tuilleamh a bheith i gceist leis an gcaillteanas fostaíochta

source: For example, if you are engaged under a contract for service to work (on a self-employed basis) for 3 days per week and unemployed for the remainder of the week, you may qualify for Jobseeker’s Benefit
ga: Mar shampla, má tá tú faoi chonradh seirbhíse oibre (ar bhonn féinfhostaithe) ar feadh 3 lá in aghaidh na seachtaine, d’fhéadfá a bheith incháilithe do Shochar Cuardaitheora Poist

source: Jobseeker’s Benefit is taxable
ga: Tá Sochar Cuardaitheora Poist inchánach

source: If you do not qualify for Jobseeker’s Benefit you may get Jobseeker’s Allowance
ga: Mura gcáilíonn tú do Shochar Cuardaitheora Poist, d’fhéadfá Liúntas Cuardaitheora Poist a fháil

source: When you apply for Jobseeker’s Benefit you will be asked if you want to be assessed for Jobseeker’s Allowance if your claim for Jobseeker’s Benefit is unsuccessful
ga: Nuair a dhéantar iarratas ar Shochar Cuardaitheora Poist, iarrfar ort ar mhaith leat go ndéanfaí measúnú ort don Liúntas Cuardaitheora Poist mura mbíonn rath ar an éileamh do Shochar Cuardaitheora Poist

source: To get Jobseeker’s Allowance you must be habitually resident and pass a means test
ga: Caithfidh tú na coinníollacha a leanas a shásamh chun Liúntas Cuardaitheora Poist a fháil:

source: If you are self-employed, you may be entitled to Jobseeker's Allowance depending on your earnings from your business
ga: • Dífhostaithe • Ábalta oibriú, ar fáil chun oibre agus go fírinneach ag cuardach oibre • Gnáthchónaí

source: You do not need to close your business or stop working as self-employed for you to get Jobseeker’s Allowance
ga: Má tá tú féinfhostaithe, d’fhéadfá a bheith i dteideal do Liúntas Cuardaitheora Poist ag brath ar thuillimh an ghnó atá agat

source: You will get Jobseeker’s Allowance if your income is below a certain level
ga: Ní gá duit do ghnó a dhúnadh nó stopadh ag obair mar dhuine féinfhostaithe chun Liúntas Cuardaitheora Poist a fháil

source: Income from self-employment and the means test
ga: Ioncam féinfhostaíochta agus tástáil mhaoine

source: The earnings from your business will be assessed in the means test for Jobseeker’s Allowance
ga: Déantar na tuillimh ghnó atá agat a mheasúnú sa tástáil mhaoine don Liúntas Cuardaitheora Poist

source: The assessment must reflect the income you may reasonably be expected to get from your business over the next 12 months
ga: Caithfidh an measúnú tuar réasúnta a thabhairt den ioncam ón ghnó sna chéad 12 mhí amach romhainn

source: Income for the last 12 months will be taken as a guide but allowing for any factors which it is known will vary
ga: Glacfar le hioncam sna 12 mhí deiridh mar threoir, ach ceadófar do thosca ar bith a dhéanfadh cúrsaí a athrú

source: You should be prepared to discuss these factors when you are assessed for Jobseeker’s Allowance
ga: Ba chóir duit a bheith réidh leis na tosca seo a phlé nuair atá measúnú á dhéanamh don Liúntas Cuardaitheora Poist

source: Earnings are assessed as gross income less work related expenses over 12 months
ga: Déantar na tuillimh a mheasúnú mar ollioncam lúide na costais a bhaineann le hobair thar tréimhse 12 mhí

source: Your expected annual earnings from self-employment is divided by 52 to find your weekly means from self-employment
ga: Déantar do thuillimh bhliantúla tuartha a roinnt faoi 52 chun d’acmhainní seachtainiúla ó fhéinfhostaíocht a fháil

source: Any ‘drawings’ you take from the business is not an allowable expense
ga: Níl ‘tarraingtí’ ar bith a bhaintear ón ngnó incheadaithe mar chostas

source: If your ‘drawings’ from the business are greater than the level of income calculated, the ‘drawings’ are assessed as cash income
ga: Má tá do ‘tharraingtí’ ón ghnó níos mó ná an leibhéal ioncaim a ríomhtar, déantar ‘tarraingtí’ a mheasúnú mar ioncam in airgead tirim

source: There is no exhaustive list of all business expenses allowed because expenses vary with the nature and extent of the self-employment
ga: Níl aon liosta uileghabhálacha de chostais uile toisc nádúr agus réim na féinfhostaíochta

source: However the following are the main allowable expenses in most cases:
ga: Mar sin, is iad na nithe a leanas na príomhchostais incheadaithe sa chuid is mó de chásanna:

source: • Motor running costs (portion applicable to business)
ga: • Costais coinneála mótair (sciar a bhaineann leis an ngnó)

source: • Depreciation of machinery or equipment
ga: • Dímheas innealra nó trealaimh

source: • Insurance relating to the business
ga: • Árachas a bhaineann leis an ngnó

source: • Telephone (portion applicable to business)
ga: • Teileafón (sciar a bhaineann leis an ngnó)

source: • Lighting and heating (for business and not domestic use)
ga: • Soilsiú agus téamh (don ghnó agus ní úsáid sa bhaile)

source: • Any other costs associated with running the business (household running costs are not allowed as deductions against business profit)
ga: • Níl costais reatha teaghlaigh ceadaithe mar asbhaintí in aghaidh bhrabúis ghnó

source: To prove the level of income from your business you must give your receipts and payments (documentation showing money coming in and out of your business) or audited accounts to the person dealing with your application in your Intreo centre or social welfare local office
ga: Chun an leibhéal ioncaim ón ghnó atá agat a ríomh caithfidh tú d’admhálacha agus íocaíochtaí (cáipéisíocht a léiríonn airgead ag teacht isteach agus amach ón ghnó atá agat) nó cuntais iniúchta a thabhairt don duine ag déileáil le d’iarratas san Oifig Leasa Shóisialaigh áitiúil

source: When you apply for Jobseeker’s Allowance
ga: Nuair a dhéantar iarratas ar Liúntas Cuardaitheora Poist (LCP)

source: Usually, you will be asked for your receipts and payments or audited accounts for the current and previous year
ga: Go hiondúil, iarrfar d’admhálacha agus íocaíochtaí nó cuntais iniúchta ort don bhliain reatha agus an bhliain roimhe sin

source: For example, if you apply for Jobseeker's Allowance in April 2017 you will be asked for your receipts and payments from January to April 2017 and for 2016
ga: Mar shampla, má dhéantar iarratas ar Liúntas Cuardaitheora Poist, iarrfar ort d’admhálacha agus íocaíochtaí ó Eanáir go Meitheamh 2017 agus do 2016 a thabhairt

source: However, in certain cases you may be required to show audited accounts for the last two or more years
ga: Mar sin féin, d’fhéadfadh dualgas a bheith ort cuntais iniúchta a thaispeáint do dhá bhliain deiridh nó níos mó

source: Find out more about signing on for a jobseeker’s payment
ga: Faigh tuilleadh eolais faoi shíniú d’íocaíocht cuardaitheora poist

source: You may qualify for Supplementary Welfare Allowance while you are waiting to be assessed for a jobseeker’s payment or if you don’t qualify for a jobseeker’s payment
ga: D’fhéadfá a bheith incháilithe don Liúntas Leasa Forlíontach nuair atá tú ag feitheamh ar mheasúnú don íocaíocht cuardaitheora poist nó mura gcáilíonn tú don íocaíocht cuardaitheora poist

source: Supplementary Welfare Allowance provides a basic weekly allowance to eligible people who have little or no income
ga: Soláthraíonn Liúntas Leasa Forlíontach bunliúntas seachtainiúil do dhaoine incháilithe atá ar bheagán ioncaim nó gan ioncam ar bith

source: If your weekly income is below the Supplementary Welfare Allowance rate for your family size, a payment may be made to bring your income up to the appropriate Supplementary Welfare Allowance rate
ga: Má tá d’ioncam seachtainiúil faoin ráta Liúntais Leasa Fhorlíontaigh do mhéid an teaghlaigh atá agat, is féidir íocaíocht a dhéanamh a thabharfaidh d’ioncam chomh fada le ráta iomchuí Liúntais Leasa Fhorlíontaigh

source: You cannot get Supplementary Welfare Allowance if you are working more than 30 hours per week. If you have claimed a jobseeker’s payment but it has not yet been paid and you have no other income, you may qualify for Supplementary Welfare Allowance while you are awaiting payment
ga: Má tá éileamh déanta agat ar íocaíocht cuardaitheora poist ach nár íocadh rud ar bith fós agus nach bhfuil aon ioncam eile agat, d’fhéadfá a bheith incháilithe don Liúntas Leasa Forlíontach nuair atá tú ag feitheamh ar d’íocaíocht

source: If your income is below a certain amount you may get a medical card or a GP visit card
ga: Má thiteann d’ioncam faoi bhun méid áirithe, d’fhéadfá Cárta Leighis nó Cárta Cuairte DG a fháil

source: You may get help with paying your rent
ga: D’fhéadfá cúnamh le cíos a íoc

source: If you are in local authority housing you should contact your local authority and ask for a review of your rent because of the reduction in your income
ga: Má tá tithíocht údaráis áitiúil agat, ba chóir duit teagmháil a dhéanamh leis an údarás áitiúil agus iarraidh orthu do chíos a athbhreithniú toisc laghdú ioncaim

source: You may get help with the cost of uniforms and footwear for children attending school
ga: Leanaí ar scoil D’fhéadfá cúnamh a fháil le costas éadaí agus coisbhirt do leanaí scoile

source: The Back to School Clothing and Footwear Allowance Scheme operates from 1 June to 30 September each year
ga: Feidhmíonn an Scéim Liúntais Éadaí agus Coisbhirt don Scoilbhliain Nua ón 1 Meitheamh go dtí an 30 Meán Fómhair gach bliain

source: If you have an exceptional or urgent need, for example, you need help with a funeral bill, a range of discretionary payments are provided by the Department of Social Protection's representative (formerly known as the Community Welfare Officer) in your local health centre
ga: Má tá riachtanas eisceachtúil nó práinneach agat, mar shampla cúnamh le bille sochraide, tá raon íocaíochtaí lánroghnacha soláthraithe ag an Oifigeach Leasa Pobail i d'Oifig Sláinte Áitiúil
